const bnMap = {
  "অ": "a", "আ": "aa", "ই": "i", "ঈ": "ii",
  "উ": "u", "ঊ": "uu", "এ": "e", "ঐ": "oi",
  "ও": "o", "ঔ": "ou",

  "ক": "k", "খ": "kh", "গ": "g", "ঘ": "gh",
  "চ": "ch", "ছ": "chh", "জ": "j", "ঝ": "jh",
  "ট": "t", "ঠ": "th", "ড": "d", "ঢ": "dh",
  "ত": "t", "থ": "th", "দ": "d", "ধ": "dh",
  "ন": "n",
  "প": "p", "ফ": "ph", "ব": "b", "ভ": "bh",
  "ম": "m",
  "য": "y", "র": "r", "ল": "l",
  "শ": "sh", "ষ": "sh", "স": "s",
  "হ": "h",
  "া": "a", "ি": "i", "ী": "i", "ু": "u", "ূ": "u",
  "ে": "e", "ৈ": "oi", "ো": "o", "ৌ": "ou",
  "্": ""
}

export const bnToEn = (text = "") =>
  text
    .split("")
    .map((char) => bnMap[char] || char)
    .join("")
